# Space_AddZone

## Description
Add a new Zone for the Space Object.

```pascal
PROCEDURE Space_AddZone(
				zoneType : STRING;
				zoneName : STRING);
```

```python

def vs.Space_AddZone(zoneType, zoneName):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|zoneType|STRING||
|zoneName|STRING||

## Version
Availability: from Vectorworks 2014
## Category
* SpaceObjectCoreTools